print('20012374-11班-董亚杰')
'''
# 已知两个列表stuInfo、head定义如下，分别是学生信息列表和学生信息表头列表：完成以下题目
# ****将本人信息手工添加到stuInfo**********
#
# 20级题目1、依据以上数据实现学生成绩查询，由用户选择按学生学号或姓名进行查询,查询成功按以下格式输出该学生的成绩信息，
#
#               ***************************学生成绩信息***************************
#               班级:信院20-11	学号:20012351	姓名:何嘉杰	性别:男	成绩:86
#
#           查询失败提示“查无此人”。
#           要求实现多次查询，直到用户提出退出请求结束查询
'''
stuInfo=[
['信院20-11','20012374', '董亚杰','男', 94],
['信院20-04','20012132', '于华美','女', 90],
['信院20-08','20012248', '王佳铭', '男', 100],
['信院20-06','20012186', '艾浩枫', '男', 76],
['信院20-04','20012133', '井瑶函', '女', 96],
['信院20-04','20012141', '刘美玲', '女', 92],
['信院20-05','20012179', '阳运飚', '男', 98],
['信院20-06','20012184', '王乳宁', '女', 82],
['信院20-10','20012327', '艾佳馨', '女', 82],
['信院20-11','20012353', '宋杭弛', '男', 83],
['信院20-08','20012260', '孟祥竹', '男', 100],
['信院20-08','20012270', '高艺嘉', '女', 83],
['信院20-11','20012356', '苗旺', '男', 81],
['信院20-09','20012285', '刘福聪', '男',60],
['信院20-10','20012325', '姜建名', '男',89],
['信院20-09','20012282', '白益豪', '男',78],
['信院20-10','20012330', '张小涵', '女',87],
['信院20-11','20012351', '何嘉杰', '男',86],
['信院20-09','20012287', '吴明鹏', '男',92],
['信院20-11','20012375', '袁 萍', '女',86]
]

head=['班级','学号','姓名','性别','成绩']

# def chooseById(rid):
#     aL = []
#     for item in stuInfo:
#         aT = zip(head, item)
#         aL.append(dict(aT))
#     # print(aL, '\n')
#     # print(type(aL))
#     # print(len(aL))
#     for id in aL:
#         # print(id)
#         if id.get('学号')==rid:
#             print('************************************学生成绩信息****************************************')
#             return str(id)[1:-1]+'\n'
# def  chooseByName(rname):
#     aL = []
#     for item in stuInfo:
#         aT = zip(head, item)
#         aL.append(dict(aT))
#     # print(aL, '\n')
#     # print(type(aL))
#     # print(len(aL))
#     for name in aL:
#         # print(id)
#         if name.get('姓名') == rname:
#             print('************************************学生成绩信息****************************************')
#             # return str(name)[1:-1].strip(',')+'\n'
#             for k,v in name.items():
#                 print(k,':',v,end='\t')
#
# def close():
#     exit()
# if __name__ == '__main__':
#     a=int(input('开始程序(1)\n'))
# while True:
#     if a==1:
#      x=int(input('请选择按学生学号或姓名进行查询（选择0/1）\n'))
#      if  x==0:#按学生学号进行查询
#             rid=input('请输入您想查询学生的学生学号：\n')
#             print(chooseById(rid).center(20),end=' ')
#      elif x==1:
#          rname=input('请输入您想查询学生的学生姓名\n')
#          print(chooseByName(rname))
#      else:
#          print('请输入合法数据')
#     else:
#         close()
'''
20级题目2：将以上学生数据按班级升序排序，班级内按分数升序排列后输出，输出格式如下所示：

                                 成绩单                                  
----------------------------------------------------------------------
班级      	学号      	姓名      	性别      	成绩      	
信院20-04 	20012132	于华美     	女       	90      	
信院20-04 	20012141	刘美玲     	女       	92      	
信院20-04 	20012133	井瑶函     	女       	96      	
信院20-05 	20012179	阳运飚     	男       	98      	
信院20-06 	20012186	艾浩枫     	男       	76      	
信院20-06 	20012184	王乳宁     	女       	82       
'''
c=[]
from operator import itemgetter
c=sorted(stuInfo,key=itemgetter(0,4),reverse=False)#默认按升序排列
print(c)
# print(" 成绩单".center(70,' '))
# print("".center(70,'-'))
# # print("班级         学号    姓名    性别   成绩")
#
# for j in range(len(head)):
#     print('%-8s'%head[j],end='\t')
# # for i in c:
# #     print(i[0],i[1],i[2],i[3],i[4])
# for item in c:
#     for i in range(len(item)):
#         print('%-8s'%item[i], end='\t')
#     print()


