'''
已知两个列表定义如下，分别是学生信息列表和学生信息表头列表：完成以下4-6题目
'''
stuInfo=[
['20012132', '于华美', '女', '90'],
['20012133', '井瑶函', '女', '96'],
['20012141', '刘美玲', '女', '92'],
['20012179', '阳运飚', '男', '98'],
['20012184', '王乳宁', '女', '52'],
['20012186', '艾浩枫', '男', '26'],
['20012248', '王佳铭', '男', '100'],
['20012260', '孟祥竹', '男', '100'],
['20012270', '高艺嘉', '女', '13'],
['20012282', '白益豪', '男', '74'],
['20012285', '刘福聪', '男', '60'],
['20012287', '吴明鹏', '男', '92'],
['20012325', '姜建名', '男', '89'],
['20012327', '艾佳馨', '女', '62'],
['20012330', '张小涵', '女', '57'],
['20012351', '何嘉杰', '男', '66'],
['20012353', '宋杭弛', '男', '53'],
['20012356', '苗旺', '男', '61'],
['20012375', '袁萍', '女', '66']
]

head=['学号','姓名','性别','成绩']
print('董亚杰-20012374')
'''
4-统计班级男同学和女同学的人数\
嵌套列表stuInfo[i][2]
'''
men=0
for i in range(len(stuInfo)): #范围为[0,len(stuInfo)-1]
    if stuInfo[i][2] == '男':
        men+=1
women=len(stuInfo)-men
print('男生人数'+str(men)+',女生人数'+str(women))
'''
5-输出分数最高的学生的信息
'''
LScore=[] #读取每位同学的成绩存入一个列表
for i in range(len(stuInfo)): #范围为[0,len(stuInfo)-1]
    LScore.append(int(stuInfo[i][3]))
maxScore=max(LScore)
print('最大成绩为：'+str(maxScore))
LMax=[] #空列表  嵌套列表
for j in stuInfo:
    if int(j[3])==maxScore:
        LMax.append(j)
# print(LMax)
for k in LMax:
    print(*k)
'''
6-定义一个空列表score,将每位同学（学号，成绩）生成一个元组，作为列表score的一个元素，并且按照如下格式显示：
2111118101--90
2111118102--80
2111118103--82
2111118104--84
2111118105--88
2111118106--82
2111118107--80
2111118108--81
2111118109--96
2111118110--83
2111118112--84
2111118113--80
'''
score=[]
for i in stuInfo:
    t=(i[0],i[3])
    score.append(t)
    # score.extend(t)
print(score)
for j in score:
    print(j[0]+'-'+j[1])
