"""
20级字典第二次作业：基于字典第一次作业中的学生数据列表完成以下各题目：
（2）统计该班同学各个分数段的人数比例：
    (其中round(a，2):该函数是使变量a的值保留两位小数，float(a)是将整数转换为浮点数)
    即90至100分人数所占比例，
    80至89分人数所占比例，
    70至79分人数所占比例，
    60分至69分人数所占比例，
    不及格人数比例
    并按如下格式显示各分数段比例：
    优秀率：25.86%
    良好率：66%
    中等率：3%
    及格率：3%
    不及格率：2%
（3）找出所有的男同学，并存入新列表中
（4）统计班级男同学和女同学的人数
（5）输出分数最高的学生的信息
（6）定义一个空列表score，将每位同学（学号，成绩）生成一个元组，
    作为列表score的一个元素，并且按照如下格式显示：
    20012466--906
    20012467--80
"""
print('董亚杰')
head=['学号','姓名','性别','成绩']
stuInfo=[
['20012132', '于华美', '女', '90'],
['20012133', '井瑶函', '女', '96'],
['20012141', '刘美玲', '女', '72'],
['20012179', '阳运飚', '男', '88'],
['20012184', '王乳宁', '女', '52'],
['20012186', '艾浩枫', '男', '66'],
['20012248', '王佳铭', '男', '71'],
['20012260', '孟祥竹', '男', '96'],
['20012270', '高艺嘉', '女', '83'],
['20012282', '白益豪', '男', '74'],
['20012285', '刘福聪', '男', '60'],
['20012287', '吴明鹏', '男', '92'],
['20012325', '姜建名', '男', '89'],
['20012327', '艾佳馨', '女', '62'],
['20012330', '张小涵', '女', '57'],
['20012351', '何嘉杰', '男', '66'],
['20012353', '宋杭弛', '男', '53'],
['20012356', '苗旺', '男', '61'],
['20012375', '袁萍', '女', '66']
]

aL = []
for item in stuInfo:
    aT = zip(head, item)
    aL.append(dict(aT))
print(aL)
print(type(aL))
print(len(aL))

# # 统计该班同学各个分数段的人数比例：
A = 0
B= 0
C = 0
D = 0
E = 0
print("第一题求解：")
for info in aL:
    print(info)
    if 90 <= int(info['成绩']) <= 100:    # 优秀
        A += 1
    elif int(info['成绩']) >= 80:         # 良好
        B += 1
    elif int(info['成绩']) >= 70:         # 中等
        C += 1
    elif int(info['成绩']) >= 60:         # 及格
        D += 1
    else:                                # 不及格
        E += 1
print("优秀率"+':'+str(round(float(A/len(stuInfo) * 100), 2))+'%')
print('良好率'+':'+str(round(float(B/len(stuInfo) * 100), 2))+'%')
print("中等率"+':'+str(round(float(C/len(stuInfo) * 100), 2))+'%')
print("及格率"+':'+str(round(float(D/len(stuInfo) * 100), 2))+'%')
print("不及格率"+':'+str(round(float(E/len(stuInfo) * 100), 2))+'%')

#
# 找出所有的男同学，并存入新列表中
print('--------------------------' )
print("第二题求解：")
bL = []     # 用于存放男同学信息(字典)
# print(type(bL))
for info in aL:
    # print(type(info))
    if info['性别'] == '男':
        bL.append(info)
print(bL)

# # 统计班级男同学和女同学的人数
print('--------------------')
print("第三题求解：")
boy = 0  # 男同学人数
girl = 0  # 女同学人数
for info in aL:
    if info['性别'] == '男':
        boy += 1
    else:
        girl += 1
print("男同学人数："+str(boy))
print("女同学人数："+str(girl))

#
# # 输出分数最高的学生的信息
print('-----------------------------' )
print("第四题求解：")
cL = []     # 用于存放成绩
for info in aL:
    cL.append(int(info['成绩']))
maxScore = max(cL)  # 最高分
dL = []     # 存放最高分同学信息(字典)
for info in aL:
    if int(info['成绩']) == maxScore:
        dL.append(info)
print("最高分同学信息如下：")
for i in dL:
    for k, v in i.items():
        print(k,v, end="\t")
    print()

# """
# 定义一个空列表score，将每位同学（学号，成绩）生成一个元组，
# 作为列表score的一个元素，并且按照如下格式显示：
# 20012466--906
# 20012467--80
# """
print('----------------------' )
print("第五题求解：")
score = []      # 存放(学号, 成绩)元组信息
for info in aL:
    xl = tuple((info['学号'], info['成绩']))
    score.append(xl)
# print(type(score))
for x in score:
    print(str(x[0])+'--'+str(x[1]))
